blog/_posts/2013-10/2013-10-31-python-md5.html
---
layout: post
keywords: 
description: 
title: Python获取md5 
categories: [python]
tags: [python,md5]
group: archive
icon: code
featured: false
---

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 md5简介</a>
<ul>
<li><a href="#sec-1-1">1.1 md5是什么</a></li>
<li><a href="#sec-1-2">1.2 md5的作用</a></li>
</ul>
</li>
<li><a href="#sec-2">2 shell获取md5</a>
<ul>
<li><a href="#sec-2-1">2.1 获取字符串md5</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1 命令解释</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2 获取文件的md5值</a></li>
<li><a href="#sec-2-3">2.3 使用md5校验文件</a></li>
</ul>
</li>
<li><a href="#sec-3">3 python获取md5，sha1值</a>
<ul>
<li><a href="#sec-3-1">3.1 获取字符串的md5,sha1</a></li>
<li><a href="#sec-3-2">3.2 获取文件的md5,sha1</a></li>
</ul>
</li>
<li><a href="#sec-4">4 参考资料</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">md5简介</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">md5是什么</h3>
<div class="outline-text-3" id="text-1-1">

<p>MD5是message-digest algorithm 5（信息-摘要算法）的缩写，被广泛用于加密和解密技术上，它可以说是文件的“数字指纹”。任何一个文件，无论是可执行程序、图像文件、临时文件或者其他任何类型的文件，也不管它体积多大，都有且只有一个独一无二的MD5信息值，并且如果这个文件被修改过，它的MD5值也将随之改变。因此，我们可以通过对比同一文件的MD5值，来校验这个文件是否被“篡改”过。
</p></div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">md5的作用</h3>
<div class="outline-text-3" id="text-1-2">

<p>当我们下载了某个文件后，如果想知道下载的这个文件和网站的原始文件是否一模一样，就可以给自己下载的文件做个MD5校验。如果得到的MD5值和网站公布的相同，可确认所下载的文件是完整的。如有不同，说明你下载的文件是不完整的：要么就是在网络下载的过程中出现错误，要么就是此文件已被别人修改。为防止他人更改该文件时放入病毒，最好不要使用。
</p>
<p>
当我们用E-mail给好友发送文件时，可以将要发送文件的MD5值告诉对方，这样好友收到该文件以后即可对其进行校验，来确定文件是否安全。
</p>
<p>
再比如：在刚安装好系统后可以给系统文件做个MD5校验，过了一段时间后如果你怀疑某些文件被人换掉，那么就可以给那些被怀疑的文件做个MD5校验，若和从前得到的MD5校验码不一样，那么就可以肯定是有问题的。
</p>
<p>
另：计算MD5值和SHA1值的算法不同，作用一样
</p></div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">shell获取md5</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">获取字符串md5</h3>
<div class="outline-text-3" id="text-2-1">




<pre class="src src-sh"><span style="color: #cd6600;">echo</span> -n <span style="color: #8b7355;">'hello'</span>|md5sum|cut -d <span style="color: #8b7355;">' '</span> -f1
5d41402abc4b2a76b9719d911017c592
</pre>


</div>

<div id="outline-container-2-1-1" class="outline-4">
<h4 id="sec-2-1-1">命令解释</h4>
<div class="outline-text-4" id="text-2-1-1">

<dl>
<dt>md5sum</dt><dd>显示或检查 MD5(128-bit) 校验和,若没有文件选项，或者文件处为”-”，则从标准输入读取。
</dd>
<dt>echo -n</dt><dd>不打印换行符。
</dd>
<dt>cut</dt><dd>cut用来从标准输入或文本文件中剪切列或域。剪切文本可以将之粘贴到一个文本文件。
</dd>
<dt>-d</dt><dd>指定与空格和tab键不同的域分隔符。-f1 表示第一个域。
</dd>
</dl>

</div>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">获取文件的md5值</h3>
<div class="outline-text-3" id="text-2-2">




<pre class="src src-sh">md5sum REST.docx |cut -d <span style="color: #8b7355;">' '</span> -f1
5682f30f1c8338279e5c7ff084467709
</pre>

</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3">使用md5校验文件</h3>
<div class="outline-text-3" id="text-2-3">




<pre class="src src-sh"><span style="color: #7f7f7f;">#</span><span style="color: #7f7f7f;">&#29983;&#25104;md5&#25991;&#20214;</span>
md5sum REST.docx &gt; REST.md5
<span style="color: #7f7f7f;">#</span><span style="color: #7f7f7f;">&#23558;&#38656;&#35201;&#26657;&#39564;&#30340;&#25991;&#20214;REST.docx&#19982;md5&#25991;&#20214;&#25918;&#22312;&#21516;&#19968;&#30446;&#24405;</span>
md5sum -c REST.md5
REST.docx: OK
<span style="color: #7f7f7f;">#</span><span style="color: #7f7f7f;">&#21629;&#20196;&#35299;&#37322;&#65306;md5 -c: &#20174;&#25991;&#20214;&#20013;&#35835;&#21462;MD5 &#30340;&#26657;&#39564;&#20540;&#24182;&#20104;&#20197;&#26816;&#26597;</span>
</pre>

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">python获取md5，sha1值</h2>
<div class="outline-text-2" id="text-3">

<p>hashlib是个专门提供hash算法的库，现在里面包括md5, sha1, sha224, sha256, sha384, sha512，使用非常简单、方便。 md5经常用来做用户密码的存储。而sha1则经常用作数字签名
</p>
</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1">获取字符串的md5,sha1</h3>
<div class="outline-text-3" id="text-3-1">




<pre class="src src-python"><span style="color: #1c86ee;">import</span> hashlib
<span style="color: #2e8b57;">m</span> = hashlib.md5()
m.update(<span style="color: #8b7355;">'hello'</span>)
<span style="color: #7f7f7f;">#</span><span style="color: #7f7f7f;">&#20108;&#36827;&#21046;&#32467;&#26524;</span>
m.digest()
<span style="color: #8b7355;">']A@*\xbcK*v\xb9q\x9d\x91\x10\x17\xc5\x92'</span>
<span style="color: #7f7f7f;">#</span><span style="color: #7f7f7f;">&#21313;&#20845;&#36827;&#21046;&#32467;&#26524;</span>
m.hexdigest()
<span style="color: #8b7355;">'5d41402abc4b2a76b9719d911017c592'</span>
<span style="color: #7f7f7f;">#</span><span style="color: #7f7f7f;">&#19968;&#26465;&#35821;&#21477;&#23454;&#29616;</span>
hashlib.md5(<span style="color: #8b7355;">'hello'</span>).hexdigest()
<span style="color: #8b7355;">'5d41402abc4b2a76b9719d911017c592'</span>
</pre>

<p>
计算sha1只需把代码中的md5换成sha1即可。
</p></div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2">获取文件的md5,sha1</h3>
<div class="outline-text-3" id="text-3-2">




<pre class="src src-python"><span style="color: #1c86ee;">import</span> hashlib
<span style="color: #1c86ee;">import</span> os,sys

<span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">CalcSha1</span>(filepath):
<span style="color: #7f7f7f;">#</span><span style="color: #7f7f7f;">&#25991;&#20214;&#25171;&#24320;&#26041;&#24335;&#19968;&#23450;&#35201;&#26159;&#20108;&#36827;&#21046;&#26041;&#24335;&#65292;&#26082;&#25171;&#24320;&#25991;&#20214;&#26102;&#20351;&#29992;b&#27169;&#24335;&#65292;&#21542;&#21017;Hash&#35745;&#31639;&#26159;&#22522;&#20110;&#25991;&#26412;&#30340;&#37027;&#23558;&#24471;&#21040;&#38169;&#35823;&#30340;&#25991;&#20214;Hash</span>
    <span style="color: #2e8b57;">f</span> = <span style="color: #cd6600;">open</span>(filepath,<span style="color: #8b7355;">'rb'</span>)
    <span style="color: #2e8b57;">sha1obj</span> = hashlib.sha1()
    sha1obj.update(f.read())
    <span style="color: #cd6600;">hash</span> = sha1obj.hexdigest()
    <span style="color: #1c86ee;">return</span> <span style="color: #cd6600;">hash</span>

<span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">CalcMD5</span>(filepath):
    <span style="color: #2e8b57;">f</span> = <span style="color: #cd6600;">open</span>(filepath,<span style="color: #8b7355;">'rb'</span>)
    <span style="color: #2e8b57;">md5obj</span> = hashlib.md5()
    md5obj.update(f.read())
    <span style="color: #cd6600;">hash</span> = md5obj.hexdigest()
    <span style="color: #1c86ee;">return</span> <span style="color: #cd6600;">hash</span>

<span style="color: #1c86ee;">if</span> <span style="color: #cd6600;">__name__</span> == <span style="color: #8b7355;">"__main__"</span>:
    <span style="color: #1c86ee;">if</span> <span style="color: #cd6600;">len</span>(sys.argv)==2 :
        hashfile = sys.argv[1]
        <span style="color: #1c86ee;">if</span> <span style="color: #1c86ee;">not</span> os.path.exists(hashfile):
            hashfile = os.path.join(os.path.dirname(__file__),hashfile)
            <span style="color: #1c86ee;">if</span> <span style="color: #1c86ee;">not</span> os.path.exists(hashfile):
                <span style="color: #1c86ee;">print</span>(<span style="color: #8b7355;">"cannot found file"</span>)
            <span style="color: #1c86ee;">else</span>:
                <span style="color: #1c86ee;">print</span> <span style="color: #8b7355;">"MD5: %s"</span> % CalcMD5(hashfile)
                <span style="color: #1c86ee;">print</span> <span style="color: #8b7355;">"Sha1: %s"</span> %CalcSha1(hashfile)
        <span style="color: #1c86ee;">else</span>:
                <span style="color: #1c86ee;">print</span> <span style="color: #8b7355;">"MD5: %s"</span> % CalcMD5(hashfile)
                <span style="color: #1c86ee;">print</span> <span style="color: #8b7355;">"Sha1 %s"</span> % CalcSha1(hashfile)
            <span style="color: #7f7f7f;">#</span><span style="color: #7f7f7f;">raw_input("pause")</span>
    <span style="color: #1c86ee;">else</span>:
        <span style="color: #1c86ee;">print</span>(<span style="color: #8b7355;">"no filename"</span>)

<span style="color: #7f7f7f;">#</span><span style="color: #7f7f7f;">&#36755;&#20986;&#32467;&#26524;</span>
python get_md5.py REST.docx
MD5: 5682f30f1c8338279e5c7ff084467709
Sha1 17b0a7b828dcedda1b8cdf383926651e75bfdba3
</pre>

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">参考资料</h2>
<div class="outline-text-2" id="text-4">

<p><a href="http://blog.csdn.net/tys1986blueboy/article/details/7229199">Python hashlib模块</a>
</p>
<p>
<a href="http://www.cnblogs.com/thinkingfor/archive/2010/09/13/1824766.html">Python 文件Hash(MD5,SHA1)</a>
</p></div>
</div>
